[
  {
    "id": "50f48544-a78c-4d7a-9abf-eba9d8cbe050",
    "address": "2 Victory Street, Croydon, Vic 3136",
    "suburb": "croydon",
    "description": "Real estate remains one of the most reliable and rewarding investment opportunities. This property offers not only a home, but an exceptional chance to capitalize on a rare development opportunity, with plans and permits for three townhouses to be supplied prior to settlement. The proposed plans can be made available upon request.<br /><br />Situated in a quiet court location, this large, flat block provides a multitude of options for prospective buyers. The existing older-style home offers comfortable living with a flexible floor plan, perfect for segmenting into different zones. Whether you're looking to renovate and create a character-filled family oasis with a spacious backyard or start afresh with a custom-designed dream home, this property provides endless possibilities.<br /><br />Alternatively, with plans and permits provided prior to settlement, you can begin exploring the potential of further development. This is your chance to take advantage of a ready-made project, saving time and unlocking the potential for significant future rewards. <br /><br />Conveniently located with easy access to shops, schools, and transport, yet tucked away in a peaceful court, this property combines practicality and privacy. <br /><br />Opportunities like this are increasingly rare. Contact us today for more information - don't miss your chance to secure a piece of this exceptional investment potential.",
    "salePrice": 1100000
  },
  {
    "id": "0e912b7e-8c50-411c-98eb-60ff9e07f0fc",
    "address": "23 Happiness Way, Wyndham Vale, Vic 3024",
    "suburb": "wyndham vale",
    "description": "Set in a peaceful, family-friendly pocket of Wyndham Vale, this spacious four-bedroom home offers effortless living with a focus on comfort, practicality, and outdoor enjoyment. Whether you're upsizing, investing, or buying your forever home, this well-designed property ticks all the right boxes.<br /><br />A wide entry leads to the master suite at the front of the home, complete with a walk-in robe and private ensuite—ideal for parents seeking a quiet retreat. Three additional bedrooms are generously sized, each with built-in robes and serviced by a stylish central bathroom.<br /><br />The heart of the home is the expansive open-plan family, dining, and kitchen area. Bathed in natural light, this space is perfect for both daily living and entertaining, seamlessly connecting to a covered alfresco for year-round outdoor enjoyment.<br /><br />The kitchen is well-appointed with ample bench space, a walk-in pantry, stainless steel appliances, and a dishwasher—blending functionality with modern design.<br /><br />Additional features include a double remote garage with internal access, full-sized laundry, split system air conditioning, ducted heating, and a low-maintenance backyard.<br /><br />Located close to schools, parks, public transport, and the Manor Lakes Shopping Centre, this home combines everyday convenience with the space and style families love.<br /><br />A quality home offering generous space, great value, and a sought-after lifestyle. Contact us today to arrange your private inspection.<br /><br />Please note: furniture in some images has been virtually staged for illustrative purposes only.",
    "salePrice": 690000
  },
  {
    "id": "c7094f35-a443-4755-a9e0-a693afcbb8e7",
    "address": "3/198 Aberdeen Street, Geelong West, Vic 3218",
    "suburb": "geelong west",
    "description": "Superbly positioned between Pakington Street and Shannon Avenue, this fully renovated unit delivers stylish, low-maintenance living with everyday convenience right at your doorstep. Perfect for first-home buyers, downsizers, or investors, it offers modern comfort in a highly sought-after pocket of Geelong West.<br /><br />Inside, the open-plan living and kitchen area is light-filled and welcoming, with a well-equipped kitchen. The generous bedroom includes built-in robes, while the sleek, bathroom comes complete with an integrated laundry. An undercover car park adds further practicality.<br /><br />Step outside and enjoy the vibrant lifestyle on offer-wander to Pakington Street's cafés, restaurants, and boutique shopping, or head to Shannon Avenue for supermarkets and daily essentials. With public transport nearby and the Geelong CBD and waterfront just minutes away, this is a home that ticks every box for convenience and location.",
    "salePrice": 330000
  },
  {
    "id": "6e0dd127-9354-490d-acda-a0efb00fb331",
    "address": "6 Village Road, South Durras, NSW 2536",
    "suburb": "south durras",
    "description": "Discover your dream home in the picturesque locale of South Durras! This beautifully designed 3-bedroom, 3 bathroom plus freestanding studio, offers a perfect blend of modern architecture and natural beauty, all set on a generous 694 sqm block.<br /><br />This home boasts an open and airy floor plan that seamlessly connects the living, dining, and kitchen areas. The living room features elegant laminated flooring, an arrow wood fireplace and is perfect for relaxing or entertaining guests.<br /><br />The heart of the home is the stylish kitchen, equipped with contemporary appliances, stone benchtops and ample storage space, making it a chef's delight. Enjoy casual meals at the bar stool seating or host dinner parties in the adjacent dining room.<br /><br />Retreat to the spacious bedrooms, each designed with comfort in mind. The master suite includes a walk-in robe and an ensuite bathroom with matching stone benches, providing a private oasis for relaxation.<br /><br />Step outside to your private balcony, where you can soak in the stunning coastal scenery and enjoy the gentle sea breeze. The expansive lawn is only two steps down in the back yard, allowing easy access to the garden area, perfect for outdoor activities, gardening, or simply basking in the sun.<br /><br />There is rear lane access to the property along with a stand-alone fully approved studio.<br />Ideal for Airbnb or additional family in the busy summer season<br /><br />This home is equipped with solar panels, ensuring energy efficiency and reducing your carbon footprint while enjoying the beauty of nature that surrounds you.<br /><br />Additional features include a massive \"Man Cave storage, an oversized single garage, and proximity to the beach, making it an ideal location for those who love the outdoors and coastal living.<br /><br />Nestled in the serene neighborhood of South Durras, this property offers easy access to pristine beaches, lush wilderness, and scenic walking trails. Enjoy the tranquility of coastal living while being just a short drive from local shops, cafes, and community amenities.<br /><br />This property is set for auction, providing a fantastic opportunity to secure your slice of paradise in South Durras. Don't miss out on this exceptional home that combines modern design with the beauty of nature!<br /><br />For more information or to arrange a viewing, please contact us today. Your dream coastal lifestyle awaits at 6 Village Road, South Durras!",
    "salePrice": 1695000
  },
  {
    "id": "ea1c9604-0a07-4ac8-8a90-b5bb7cc0935d",
    "address": "203 MACQUARIE STREET, South Windsor, NSW 2756",
    "suburb": "south windsor",
    "description": "An exceptional opportunity for developers, investors, or families seeking a property with approved development potential.<br />This corner block, located in the heart of South Windsor, comes with DA approval for three spacious 5-bedroom townhouses, each with rear lane access to garages and separate studios above the garages - perfect for extended family living or extra rental income.<br /><br />Currently, the site features a well-presented 3-bedroom cottage with a potential rental return of $600 - $650 per week, providing holding income while you prepare for construction.",
    "salePrice": 1449000
  },
  {
    "id": "f3ab0048-89e4-4d23-9fe2-bfb1f613c7a3",
    "address": "131a Mitre Street, Bathurst, NSW 2795",
    "suburb": "bathurst",
    "description": "Where the best of the old has been reimagined and complemented with a large and tastefully modern addition, this property has so much to offer.<br /><br />Generous in all proportions this builders own home has been built to a superior standard ensuring a long and very enjoyable experience for its next custodian. Large bedrooms, a new ensuite to the main bedroom, underfloor heating, well planned storage in every part of the home and a lofty glass lined living space steals the show with an irreplaceable view to the north toward Mount Rankin and Macquarie River rural flats.<br /><br />The lower level of this expansive home has a huge garage with a higher opening roller door, while a full bathroom adjoins a generous rumpus room which may suit living space for multiple generations being under one roof. Also in this space is a home office, gym or utility room with direct access to the home's side access.",
    "salePrice": 1465000
  },
  {
    "id": "05661b5f-6579-4799-8411-53e7047aca40",
    "address": "8 Concorde Place, Glenorchy, Tas 7010",
    "suburb": "glenorchy",
    "description": "Tucked away in a quiet cul-de-sac, this charming three-bedroom home offers comfort, convenience, and excellent value in ever popular Glenorchy.<br /><br />Featuring a spacious layout, low-maintenance yard, and a peaceful setting, it's perfect for families, first-home buyers, or savvy investors.<br /><br />With a rental appraisal of up to $570 per week (approx.), the home offers strong investment appeal in a high-demand area.<br /><br />Don't miss your chance to secure this quality home in a sought-after location!<br /><br /><br />The information contained herein has been supplied to us and we have no reason to doubt its accuracy, however, we cannot guarantee it. Accordingly, all interested parties should make their own enquiries to verify this information.<br /><br />All timeframes and dimensions are approximates only.",
    "salePrice": 625000
  },
  {
    "id": "2f98d73b-df0c-4a3a-997f-2821bea3db24",
    "address": "703/47 Claremont Street, South Yarra, Vic 3141",
    "suburb": "south yarra",
    "description": "Perfectly positioned in one of Melbourne's most vibrant lifestyle precincts, this modern one-bedroom apartment offers the ideal blend of comfort, convenience, and style. With South Yarra Station, Chapel Street, Toorak Road dining, and the Yarra River all within walking distance, it's the ultimate choice for first-home buyers, investors, or those seeking a low-maintenance city base.",
    "salePrice": 340000
  },
  {
    "id": "8b02efa4-a354-4a27-b01b-b74e42f9e4b9",
    "address": "20 Waterside Circuit, Sandhurst, Vic 3977",
    "suburb": "sandhurst",
    "description": "Perfectly positioned in one of Melbourne's most vibrant lifestyle precincts, this modern one-bedroom apartment offers the ideal blend of comfort, convenience, and style. With South Yarra Station, Chapel Street, Toorak Road dining, and the Yarra River all within walking distance, it's the ultimate choice for first-home buyers, investors, or those seeking a low-maintenance city base.",
    "salePrice": 1700000
  },
  {
    "id": "b503dba3-7816-45d7-b732-b0de6e12dbd1",
    "address": "1 Jefferson Way, Shepparton, Vic 3630",
    "suburb": "shepparton",
    "description": "Located in the sought after North Quarter Estate overlooking the incredible park & wetlands that the estate offers, only a short drive to GV Base Hospital, CBD, Multiple schools & Sporting precinct, this brand new custom built home by Cavalier Homes has an abundance of upgrades throughout & is the complete package!<br /><br />Offering a Master Bedroom with ensuite & WIR, 2 other bedrooms with WIRs, formal living area, main bathroom with bath & separate toilet, stunning fully equipped kitchen with ceaserstone benchtops & large WIP, overlooking the open plan dining & living space soaked in natural north facing sun & incredible raked ceiling that flows out to the huge alfresco area via double sliding doors, providing the best of inside/outside entertaining!<br /><br />Outside has been fully landscaped by Michels Landscaping with fully automated watering system, low maintenance garden, exposed ag concrete surrounds, double car garage & solar panels.<br /><br />Why build when you can walk in to this sensational turn key home in a great location!",
    "salePrice": 880000
  }
]
